Repository: BaggerFast/WeightService
Catalog: Src/Apps/Desktop/ScalesDesktop/Source/Shared/Localization/ApplicationResources.*.resx
Languages: ru_ru

# BtnCooldown
source: Available in
ru_ru: Доступно через

# BtnEnter
source: Enter
ru_ru: Ввод

# BtnLabelPrint
source: Print label
ru_ru: Печать этикетки

# BtnScaleCalibration
source: Calibrate scale
ru_ru: Откалибровать весы

# BtnSelectAllLabels
source: Select all
ru_ru: Выбрать все

# BtnBack
source: Back
ru_ru: Назад

# BtnCreate
source: Create
ru_ru: Создать

# BtnLogIn
source: Login
ru_ru: Войти

# BtnPrintPC
source: Print PC
ru_ru: Печать ПК

# BtnSelectedLabelsPrinting
source: Print labels
ru_ru: Печать выбранных

# CreatePalletFormHeader
source: Create pallet form
ru_ru: Форма создания паллеты

# FuncCardCreationDescription
source: To create a new pallet, click the button at the top of the left block
ru_ru: Для создания новой паллеты, в верхней части левого блока нажмите

# FuncCardCreationTitle
source: Creation
ru_ru: Создание

# FuncCardDescription
source: Description of the main functionality of the application
ru_ru: Описание основного функционала приложения

# FuncCardHeader
source: Functional
ru_ru: Функционал

# FuncCardLabelPrintingDescription
source: To print labels, select a pallet. In the Labels tab, you can print all the labels, or select the ones you need in the table and click
ru_ru: Для печати этикеток выберите паллету. Во вкладке "Этикетки" вы можете распечатать все этикетки, либо выбрать нужные в таблице и нажать

# FuncCardLabelPrintingTitle
source: Label printing
ru_ru: Печать этикеток

# FuncCardPCPrintingDescription
source: To print a pallet card, select the pallet and go to the Information tab, then click
ru_ru: Для печати паллетной карты выберите паллету и перейдите на вкладку "Информация", затем нажмите

# FuncCardPCPrintingTitle
source: Pallet card printing
ru_ru: Печать паллетной карты

# FuncCardViewingDescription
source: To view information about the pallet, select the desired pallet in the left block
ru_ru: Для просмотра информации об паллете, выберите нужную паллету в левом блоке

# FuncCardViewingTitle
source: Viewing
ru_ru: Просмотр

# KneadingInputPlaceholder
source: Enter the kneading
ru_ru: Введите замес

# LabelConfigHeader
source: PLU config
ru_ru: Настройка ПЛУ

# LabelCountInputPlaceholder
source: Enter a label count
ru_ru: Введите количество этикеток

# PalletManFormHeader
source: Log in system
ru_ru: Вход в систему

# PalletSelectEmpty
source: No pallets found
ru_ru: Нет информации о паллетах

# PasswordInputPlaceholder
source: Enter the password
ru_ru: Введите пароль

# PluSelectHeader
source: PLU select
ru_ru: Выбор ПЛУ

# PrinterStatusHeadOpen
source: The printer head is opened
ru_ru: Открыта крышка принтера

# PrinterStatusDisconnected
source: The printer is offline
ru_ru: Принтер не в сети

# PrinterStatusPaperJam
source: The label is stuck in the printer
ru_ru: Замялась этикетка в принтере

# PrinterStatusPaperOut
source: The printer has run out of tape
ru_ru: Закончились этикетки в принтере

# PrinterStatusPaused
source: The printer is on pause
ru_ru: Принтер стоит на паузе

# PrinterStatusUnknown
source: Unknown printer error
ru_ru: Неизвестная ошибка принтера

# ScalesStatusTooLight
source: The scales lack the necessary weight.
ru_ru: На весах недостаточный вес

# ScalesStatusUnstable
source: The scales are not stable
ru_ru: Весы нестабильны

# SearchByNumberPlaceholder
source: Search by number
ru_ru: Поиск по номеру

# UserSelectPlaceholder
source: Select your user
ru_ru: Выберите пользователя

# NestingSelectPlaceholder
source: Nesting is not selected
ru_ru: Вложенность не выбрана

# PluSelectPlaceholder
source: PLU is not selected
ru_ru: ПЛУ не выбран

# BtnSelect
source: Select
ru_ru: Выбрать

# ExitAppDialogTitle
source: Do you want to log out of the app?
ru_ru: Вы хотите выйти из приложения?

# ExitAppDialogDescription
source: This action is irreversible. You will need a system administrator to log in to the application again.
ru_ru: Данное действие необратимо. Для повторного входа в приложение потребуется системный администратор.

# BtnCancel
source: Cancel
ru_ru: Отмена

# AppName
source: Weight Post
ru_ru: Весовой Пост

# BtnExit
source: Exit
ru_ru: Выход

# HomePageCardDescription
source: Select the desired item
ru_ru: Выберите необходимый пункт

# BtnUpdate
source: Update
ru_ru: Обновить

# BtnPaginationNext
source: Next
ru_ru: Следующая

# BtnPaginationPrev
source: Prev
ru_ru: Предыдущая

# BtnMenu
source: Menu
ru_ru: Меню

# BtnNext
source: Next
ru_ru: Далее

source: Unknown error
ru_ru: Неизвестная ошибка

# LineIsNewWarningTitle
source: The line is not set up
ru_ru: Линия не настроена

# LineIsNewWarningDescription
source: Please contact technical support to set up the line. After setting up the line, click "Update".
ru_ru: Пожалуйста, обратитесь к технической поддержке для настройки линии. После настройки линии нажмите "Обновить".

# ToastErrorWhileGettingData
source: Data acquisition error. Try again later.
ru_ru: Ошибка получения данных. Попробуйте еще раз позже.

# ToastPalletCreateError
source: Error creating the pallet
ru_ru: Ошибка при создании палеты

# PrinterStatusReady
source: The printer is ready
ru_ru: Принтер готов к работе

# ScalesStatusReady
source: The scales are ready
ru_ru: Весы готовы к работе

# ScalesStatusDetached
source: The scales are not connected
ru_ru: Весы не подключены

# ScalesStatusDisabled
source: The scales are offline
ru_ru: Весы выключены

# PluDescriptionNoDataTitle
source: No data
ru_ru: Нет данных

# PluDescriptionNoDataDescription
source: Select the PLU to view the information
ru_ru: Выберите ПЛУ, чтобы просмотреть информацию

# BtnReconnect
source: Reconnect
ru_ru: Переподключить

# PluDisplayUnselectedTitle
source: Set up the PLU
ru_ru: Настройте ПЛУ

# PluDisplayUnselectedDescription
source: To get started, set up the PLU in the left menu
ru_ru: Для начала работы выполните настрой ПЛУ в левом меню

# PluDisplayUnselectedStatusesInfo
source: To find out the current status of the printer and scales, click on the icons
ru_ru: Чтобы узнать текущее состояние принтера и весов нажмите на иконки

# ScalesStatusInitializing
source: The scales are initializing
ru_ru: Подготовка весов

# PalletOverviewDividerCommon
source: Common
ru_ru: Общее

# PalletCreateFinalTitle
source: Result
ru_ru: Итог

# PalletManFormInvalidPassword
source: Invalid password
ru_ru: Неверный пароль

# PalletDocumentGenerationError
source: Failed to generate document
ru_ru: Не удалось сформировать документ

# ApiResponseError
source: Server response error
ru_ru: Ошибка ответа сервера

# PrinterStatusCommonError
source: Printer status error
ru_ru: Ошибка состояния принтера

# ZplCodeError
source: Invalid zpl code
ru_ru: Неверный zpl код

# IndexedLabelNotPrinted
source: The label with the number {0} could not be sent for printing
ru_ru: Этикетку с номером {0} не удалось отправить на печать

# BtnUnselectAllLabels
source: Unselect all
ru_ru: Убрать все

# LabelsDataGridSelectedInfo
source: {0} of {1} selected
ru_ru: Выбрано {0} из {1}

# PalletCreateDialogProgressToastTitle
source: Creating a pallet
ru_ru: Создание паллеты

# PalletCreateDialogProgressToastDescription
source: It may take some time
ru_ru: Это может занять некоторое время

# PalletCreateDialogSuccess
source: The pallet has been created
ru_ru: Паллета создана

# UserSelectEmptyPlaceholder
source: The user was not found
ru_ru: Пользователь не найден

# UserSelectSearchPlaceholder
source: Search by name
ru_ru: Поиск по имени

# PrintingStoppedDueToErrors
source: Label printing stopped due to errors
ru_ru: Печать этикеток остановлена из-за ошибок

# LabelsPrintingSuccess
source: Printing has been completed successfully
ru_ru: Печать успешно завершена

# LabelsPrintingToastTitle
source: Labels printing
ru_ru: Печать этикеток

# LabelsPrintingToastDescription
source: Printed labels are removed from the list
ru_ru: Распечатанные этикетки убираются из списка

# LabelGenExcInvalid
source: Label validation error
ru_ru: Ошибка валидации этикетки

# LabelGenExcBarcodeInvalid
source: Barcode generation error
ru_ru: Ошибка генерации штрихкода

# LabelGenExcTemplateNotFound
source: The template was not found
ru_ru: Шаблон не найден

# LabelGenExcBarcodeVariableNotFound
source: Barcode variables are not defined
ru_ru: Переменные штрихкода не определенны

# LabelGenExcStorageMethodNotFound
source: The storage method is not set
ru_ru: Способ хранения не установлен

# LabelGenExcExchangeFailed
source: Integration error with 1C
ru_ru: Ошибка интеграции с 1С

# СolPalletProductDt
source: Date of pallet products
ru_ru: Дата продукции на паллете

# ColNestingPerBox
source: Number of attachments per box
ru_ru: Кол-во вложений в коробе

# ColPrint
source: Print
ru_ru: Печать
